{
	"text": "VIEWS FOR HIGH QUALITY UNIVERSITY EDUCATION: \n\n During the last decade, there was a considerable amount of attention, in particular to effective education in engineering fields. Despite all the continuing progresses in communication technologies for online teaching materials, university lecturers are still considered to be the greatest asset for improving the education system. The main reason might be that the power of face-to-face exchange of ideas is still recognized as the best method for education in both schools and universities. Through face-to-face exchange of ideas, university students and lecturers mutually increase the quality of education. There are some helpful views focusing on improving the quality of university education, and these views emerged from a decade of education experience and mentoring undergraduate and postgraduate students studying in engineering fields. The helpful views are classified into three groups: (1) views on optimal use of university facilities, (2) views on attaining optimal knowledge from lectures, and (3) views on improving test performance. These views are described substantially below. \n\n 1. Views on Optimal Use of University Facilities: \n\n The first criterion in increasing use of available university facilities is to consider libraries, laboratories, study rooms, Internet services, computer rooms and printing rooms. Students are recommended to become aware of the different facilities available in a university for their use as early as possible. Otherwise, they may not benefit from the use of these potential advantages of their university. To assist students in becoming aware of the available education facilities, many universities around the world have an orientation day for new students, and participation in this effective activity is very helpful to discover a university's amenities. During the orientation, most university staff attend to present their role and state how much they can support students in need of assistance. In addition, academic staff are the main assets of a university and play an essential role in terms of providing quality education for both undergraduate and postgraduate students. Postgraduate students are recommended to consider different academics' expertise so that they can seek effective advice to improve their research. The second criterion to use the available university facility is to cooperate with the student union. A student union is very helpful to build up friendly relationships among students as well as to share student needs for any services with university authorities. The student union is usually autonomous in the university and is democratically controlled by students. Hence, cooperation with this union can help strengthen the union and provide sufficient academic support to the students. A student union provides support for newcomers in a university through linking them with junior/senior students to pass on their experience to new students. \n\n 2. Views on Attaining Optimal Knowledge from Lectures: \n\n First, punctuality of classroom attendance helps students stay focused on the lecture notes. To illustrate, student attendance has a close correlation with class grades and the overall performance. Students who are unpunctual or miss classes frequently are significantly more likely to gain a poor grade in a given course. This is because most faculties count student attendance positively on grade determination while others count the absentees against the student grade. Therefore, students are strongly recommended to not only attend their classes but also arrive before the lecture starts. This can increase the productivity of students performance. Second, preparation and reading for the lecture in advance are highly recommended. Students are recommended to read the material that will be covered in the upcoming lecture. The prior class preparation can remarkably help students to better understand the topic and facilitate their learning performance in a course. In addition, the prior class preparation assists students in completing their notes during a lecture. Students should focus on the materials instructed during the lecture. They are recommended to imagine what is being taught will not be repeated, so it is very important that students stay focused on the classroom activities, ask questions, and volunteer for demonstrations. If any materials do not make sense for them, he or she should ask the lecturer for assistance or further clarity of the point. Thus, making the prior preparation for a lecture decreases any potential ambiguities during classroom instruction. Finally, reviewing a lecture note immediately after class helps students increase their knowledge of the course. This quick review results in better retention than reviewing after a longer period of time. Or the retention drops after 24 hours and relearning will be required rather than reviewing. In addition, while the lecture is still fresh in their mind, they can put the ideas into words for their future recall. Moreover, they can recall what parts of the lecture were unclear to them so that they can consult with the lecturer, the tutor, a classmate, or a textbook for further understanding. \n\n 3. Views on Improving Test Performance \n\n Improving test performance requires students to strengthen their knowledge of a specific topic as well as taking a test strategically. Meeting these requirements assists students in facilitating their test performance, which is closely related to their learning performance. In any exams, students should cast a quick look at the entire test before responding to any questions. This quick consideration helps them to get an overview of what is expected and to strategize how they take the test. One of the strategies is to respond to the easiest questions first so that they would be able to handle any exam related anxiety. Then, enough time is left for students to think thoroughly about rest of the questions. Thus, considering the whole exam questions provides examinees with an opportunity to manage their optimal test performance. Students should always remember that the first idea that comes to the mind might not suit for responding to a question. Therefore, students should give a second thought by realizing the meaning of a question as understanding a question mostly assists in responding to it accurately. In this regard, a student should look for the central idea of each question for responding to it appropriately. Quality education in engineering fields in university has recently been considered globally. A few of the given views, such as optimal use of university facilities, attaining optimal knowledge from lectures, and improving test performance have adequately been discussed. Despite having multiple requirements for advancing education, engineering students can increasingly improve their learning performance through following up the views stated above for quality education. ",
	"words": [
		{
			"word": "Exchange (v) :",

			"meaning": "تعویض ، معاوضه"
		},

		{
			"word": "Mentor (n) :",

			"meaning": "مربی ، ناصح"
		},

		{
			"word": "Substantial (adj) :",

			"meaning": "اساسی، مهم"
		},

		{
			"word": "Orientation  (n) :",

			"meaning": "معارفه ، آشنایی"
		},

		{
			"word": "Illustrate (v) :",

			"meaning": "توضیح دادن"
		},

		{
			"word": "Ambiguity  (n) :",

			"meaning": "ابهام، گنگی معنی"
		},

		{
			"word": "Retention (n) :",

			"meaning": "نگهداری، حفاظت"
		},

		{
			"word": " asset :",

			"meaning": "دارائی ، سرمایه"
		},

		{
			"word": "mutually :",

			"meaning": "متقابل"
		},

		{
			"word": "emerged :",

			"meaning": "بروز یافتن، پدیدار شدن"
		},

		{
			"word": "optimal :",

			"meaning": "بهینه"
		},

		{
			"word": "facilities :",

			"meaning": "وسائل"
		},

		{
			"word": "attaining :",

			"meaning": "امکانات"
		},

		{
			"word": "criterion :",

			"meaning": "معیار"
		},

		{
			"word": "recommended :",

			"meaning": "توصیه کردن"
		},

		{
			"word": "aware :",

			"meaning": "آگاه بودن"
		},

		{
			"word": "participation :",

			"meaning": "مشارکت"
		},

		{
			"word": "amenities :",

			"meaning": "امکانات"
		},

		{
			"word": "staff :",

			"meaning": "کارکنان"
		},

		{
			"word": "essential :",

			"meaning": "اساسی، ضروری"
		},

		{
			"word": "union :",

			"meaning": "انجمن"
		},

		{
			"word": "authorities :",

			"meaning": "اجازه‌،اعتبار"
		},

		{
			"word": "autonomous :",

			"meaning": "خودمختار"
		},

		{
			"word": "strengthen :",

			"meaning": "تقویت‌ کردن"
		},

		{
			"word": "newcomers :",

			"meaning": "تازه‌وارد"
		},

		{
			"word": "punctuality :",

			"meaning": "وقت شناسی، توجه بسیار"
		},

		{
			"word": "attendance :",

			"meaning": "حضور"
		},

		{
			"word": "significantly :",

			"meaning": "قابل توجه"
		},

		{
			"word": "absentees :",

			"meaning": "فرد غایب"
		},

		{
			"word": "preparation :",

			"meaning": "آمادگی"
		},

		{
			"word": "upcoming :",

			"meaning": "در‌ پیش‌ رو"
		},

		{
			"word": "remarkably :",

			"meaning": "قابل‌ توجه"
		},

		{
			"word": "performance :",

			"meaning": "عملکرد"
		},

		{
			"word": "demonstrations :",

			"meaning": "توضیح"
		},

		{
			"word": "reviewing :",

			"meaning": "مرور‌کردن،‌دوره‌کردن"
		},

		{
			"word": "immediately :",

			"meaning": "فوراً"
		},

		{
			"word": "drops :",

			"meaning": "افت‌کردن"
		},

		{
			"word": "cast :",

			"meaning": "افکندن‌"
		},

		{
			"word": "handle :",

			"meaning": "مدیریت‌ کردن"
		},

		{
			"word": "anxiety :",

			"meaning": "اضطراب"
		},

		{
			"word": "opportunity :",

			"meaning": "فرصت"
		},

		{
			"word": "suit :",

			"meaning": "مناسب‌ بودن‌‌ ، منطبق‌ بودن"
		},

		{
			"word": "appropriately :",

			"meaning": "بطور‌ مناسب"
		},

		{
			"word": "globally :",

			"meaning": "سراسری،‌جهانی"
		},

		{
			"word": "attaining :",

			"meaning": "کسب‌کردن"
		},

		{
			"word": "adequately :",

			"meaning": "به‌اندازه‌کافی"
		}
	]
}
